//
// This file contains an 'Intel Peripheral Driver' and is      
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may 
// be modified by the user, subject to additional terms of the 
// license agreement                                           
//
// *++
//
// Copyright (c) 1999 - 2016 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// 
// 
// Module Name:
//
//   CommonRefCodStrings.uni
// 
// Abstract:
// 
//   String definitions for ommon RefCode Setup formset.
// 
// Revision History:
// 
// --*/

/=#

#langdef   en-US "English"

#string STR_RC_COMMON_FORM_TITLE               #language en-US "Common RefCode Configuration"
#string STR_RC_COMMON_FORM_HELP                #language en-US "Displays and provides option to change the Common RefCode Settings"

#string STR_CSI_MMCFG_BASE                     #language en-US "MMCFG Base"
#string STR_CSI_MMCFG_BASE_HELP                #language en-US "Select MMCFG Base"
#string STR_CSI_MMCFG_SIZE                     #language en-US "MMCFG Size"
#string STR_CSI_MMCFG_SIZE_HELP                #language en-US "Select MMCFG Size"

#string STR_1G                                 #language en-US "1G"
#string STR_1_5G                               #language en-US "1.5G"
#string STR_1_75G                              #language en-US "1.75G"
#string STR_2G                                 #language en-US "2G"
#string STR_2_25G                              #language en-US "2.25G"
#string STR_3G                                 #language en-US "3G"

#string STR_CSI_MMIOH_BASE                     #language en-US "MMIO High Base"
#string STR_CSI_MMIOH_BASE_HELP                #language en-US "Select MMIO High Base"
#string STR_CSI_MMIOH_SIZE                     #language en-US "MMIO High Granularity Size"
#string STR_CSI_MMIOH_SIZE_HELP                #language en-US "Selects the allocation size used to assign mmioh resources.\nTotal mmioh space can be up to 32xgranularity.\nPer stack mmioh resource assignments are multiples of the granularity where 1 unit per stack is the default allocation."

#string STR_ISOCEN                             #language en-US "Isoc Mode"
#string STR_ISOCEN_HELP                        #language en-US "Isoc: Disable,Enable"
#string STR_MESEGEN                            #language en-US "MeSeg Mode"
#string STR_MESEGEN_HELP                       #language en-US "MeSeg: Disable,Enable"
#string STR_NUMAEN                             #language en-US "Numa"
#string STR_NUMAEN_HELP                        #language en-US "Enable or Disable Non uniform Memory Access (NUMA)."

#string STR_SRAT_PROMPT                        #language en-US "Publish SRAT"
#string STR_SRAT_HELP                          #language en-US "Publish the SRAT ACPI table to the OS."

#string STR_SRAT_MEM_HOT_PLUG_PROMPT           #language en-US "SRAT Memory Hot Plug"
#string STR_SRAT_MEM_HOT_PLUG_HELP             #language en-US "Fix for OS that does not support memory hot plug.\nEx: SuSE SLES10 SP2. \n \nEnable by default. \nDisable will clear all hot plug bits and remove the hot plug entries in SRAT table."

#string STR_SRAT_CPU_HOT_PLUG_PROMPT           #language en-US "SRAT CPU Hot Plug"
#string STR_SRAT_CPU_HOT_PLUG_HELP             #language en-US "Set Processor Flag to Enabled for all processor entries in SRAT."

